app/views/expertises/show.html.erb

<h2>Комментарии:</h2>
  <% @expertise.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE ("comments".expertise_id = 1)