app/controllers/comments_controller.rb

	def create
		@expertise = Expertise.find(params[:expertise_id])
		@comment = @expertise.comments.create(params[:comment])
---
SELECT "expertises".* FROM "expertises" WHERE "expertises"."id" = 1 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "expertise_id", "created_at", "updated_at") VALUES ('asdas', 'asdasd', 1, '2011-05-04 11:24:51.265625', '2011-05-04 11:24:51.265625')