app/controllers/expertises_controller.rb

SELECT "expertises".* FROM "expertises"
---
  def index
    @expertises = Expertise.all

SELECT "expertises".* FROM "expertises" WHERE "expertises"."id" = 1 LIMIT 1
---
  def show
    @expertise = Expertise.find(params[:id])

SELECT "expertises".* FROM "expertises" WHERE "expertises"."id" = 1 LIMIT 1
---
  def edit
    @expertise = Expertise.find(params[:id])

INSERT INTO "expertises" ("name", "content", "created_at", "updated_at") VALUES ('asdas', '12312', '2011-05-04 11:22:57.062500', '2011-05-04 11:22:57.062500')
---
  def create
    @expertise = Expertise.new(params[:expertise])

    respond_to do |format|
      if @expertise.save

SELECT "expertises".* FROM "expertises" WHERE "expertises"."id" = 1 LIMIT 1
UPDATE "expertises" SET "name" = 'Тест эксперт', "content" = 'текст текст текст', "image_file_name" = '1.jpg', "image_content_type" = 'image/jpeg', "image_file_size" = 146127, "image_updated_at" = '2011-05-04 11:41:56.859375', "updated_at" = '2011-05-04 11:41:57.828125' WHERE "expertises"."id" = 1
---
  def update
    @expertise = Expertise.find(params[:id])

    respond_to do |format|
      if @expertise.update_attributes(params[:expertise])