app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolios = Portfolio.all

SELECT "portfolios".* FROM "portfolios"
---
  def list
    @portfolios = Portfolio.all

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = 1 LIMIT 1
---
  def show
    @portfolio = Portfolio.find(params[:id])

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = 2 LIMIT 1
---
  def edit
    @portfolio = Portfolio.find(params[:id])

INSERT INTO "portfolios" ("name", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ('1', '2011-05-04 07:58:13.359375', '2011-05-04 07:58:13.359375', '1.jpg', 'image/jpeg', 146127, '2011-05-04 07:58:13.250000')
---
  def create
    @portfolio = Portfolio.new(params[:portfolio])

    respond_to do |format|
      if @portfolio.save

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = 2 LIMIT 1
UPDATE "portfolios" SET "image_file_name" = '2.jpg', "image_content_type" = 'image/jpeg', "image_file_size" = 111363, "image_updated_at" = '2011-05-04 08:12:47.328125', "updated_at" = '2011-05-04 08:12:48.578125' WHERE "portfolios"."id" = 1
---
  def update
    @portfolio = Portfolio.find(params[:id])

    respond_to do |format|
      if @portfolio.update_attributes(params[:portfolio])